In [1]:
%matplotlib inline

In [2]:
#dependencies
from sqlalchemy import create_engine
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from random import randint

In [9]:
#create engine to connect postgres data
engine = create_engine('postgres://postgres:postgrespostgres@localhost:5432/HMW_9_SQL')
connection = engine.connect()

data_salaries = pd.read_sql("SELECT * FROM salaries", connection)
data_titles = pd.read_sql("SELECT * FROM titles", connection)


# Join DF's
final_df = pd.merge(data_salaries,data_titles, on='emp_no',suffixes=('_salaries','_titles'))
final_df.head()
final_df.salary = final_df.salary.map('${:,}'.format)
final_df.head()

,emp_no,salary,from_date_salaries,to_date_salaries,title,from_date_titles,to_date_titles
0,10001,"$60,117",1986-06-26,1987-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,"$65,828",1996-08-03,1997-08-03,Staff,1996-08-03,9999-01-01
2,10003,"$40,006",1995-12-03,1996-12-02,Senior Engineer,1995-12-03,9999-01-01
3,10004,"$40,054",1986-12-01,1987-12-01,Engineer,1986-12-01,1995-12-01
4,10004,"$40,054",1986-12-01,1987-12-01,Senior Engineer,1995-12-01,9999-01-01

In [ ]:
#Create a histogram to visualize the most common salary ranges for employees.
salary_list=final_df.salary.to_list()
plt.hist(salary_list,rwidth=0.9,bins=10,edgecolor='black')

plt.xlabel('Employee Salary')
plt.ylabel('Employee count per salary')
plt.tight_layout()

In [ ]:
#Create a bar chart of average salary by title.
final_df.head()
cleaned_df_graph_2 = final_df.groupby('title').mean()
del cleaned_df_graph_2['emp_no']

In [ ]:
#round salary column
cleaned_df_graph_2_rounded=cleaned_df_graph_2['salary'] = cleaned_df_graph_2['salary'].astype(int)
final_df_for_graph2=cleaned_df_graph_2_rounded.reset_index()

In [ ]:
#create bar graph
plt.bar(final_df_for_graph2.title,final_df_for_graph2.salary,align="center",edgecolor='black')
ticks = np.arange(len(x))
plt.xticks(ticks,rotation=90)
plt.xlabel('Employee Title')
plt.ylabel('Average Salary $')
plt.title('Average Salary per Employee Title')
plt.savefig()